loadtests/tests.yml
config:
  target: http://10.152.183.89:8081
  phases:
    - name: "Warm up service"
      duration: 15
      arrivalRate: 5
      rampTo: 20
    - name: "Ramp up high load"
      duration: 100
      arrivalRate: 20
      rampTo: 30
    - name: "Sustained high load"
      duration: 300
      arrivalRate: 30
      rampTo: 40
  ensure:
    maxErrorRate: 1
  payload:
    path: 'mock_data.csv'
    fields:
      - 'userId'
      - 'title'
      - 'description'
      - 'time'
      - 'ingredients'
      - 'steps'
    skipHeader: true

scenarios:
  - name: "Create new recipe & get recipes"
    flow:
      - post:
          url: "/recipe/1/operations/create"
          formData:
            title: "{{ title }}"
            description: "{{ description }}"
            time: "{{ time }}"
            steps: "{{ steps }}"
            ingredients: "{{ ingredients }}"
          capture:
            - json: "$.id"
              as: "id"
      - get:
          url: "/recipe/view"